# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

print('Задача 1')
list = [1, 2, 3, 4, 5, 7, 8, 9, 12, 15, 121, 232, 432,-100,-3,-234]
list1 = [n ** 2 for n in list]
print(list, '->', list1)

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.
print()
print('Задача 2')
fruct1 = ['яблоко', 'банан', 'апельсин', 'киви']
fruct2 = ['манго', 'грейпфрут', 'апельсин', 'груша', 'ананас', 'банан']
fruct3 = [i for i in fruct1 if i in fruct2]
print(fruct3)

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4
print()
print('Задача 3')
list2 = [i for i in list if i >= 0 and i % 3 == 0 and i % 4 != 0]
print(list, '->', list2)
