# Задание - 1
# Вам даны 2 списка одинаковой длины, в первом списке имена людей, во втором зарплаты,
# вам необходимо получить на выходе словарь, где ключ - имя, значение - зарплата.
# Запишите результаты в файл salary.txt так, чтобы на каждой строке было 2 столбца,
# столбцы разделяются пробелом, тире, пробелом. в первом имя, во втором зарплата, например: Vasya - 5000
# После чего прочитайте файл, выведите построчно имя и зарплату минус 13% (налоги ведь),
# Есть условие, не отображать людей получающих более зарплату 500000, как именно
#  выполнить условие решать вам, можете не писать в файл
# можете не выводить, подумайте какой способ будет наиболее правильным и оптимальным,
#  если скажем эти файлы потом придется передавать.
# Так же при выводе имя должно быть полностью в верхнем регистре!
# Подумайте вспоминая урок, как это можно сделать максимально кратко, используя возможности языка Python.

names = ['Иван', 'Роман', 'Алексей', 'Евгений', 'Алена', 'Мария', 'Анастасия', 'Яна']
salary = ['200000', '500001', '510000', '490000', '3000000', '200000', '150000', '300000']
mutch = list(zip(names, salary))
with open('salary.txt', 'w', encoding='utf-8') as file:
    for line in mutch:
        if int(line[1]) > 500000: # черная бухгалтерия)
            pass
        else:
            file.write(str(line[0].upper()) + ' - ' + str(line[1]) + '\n')

with open('salary.txt', 'r', encoding='utf-8') as file2:
    for l in file2:
        salary13 = l[l.rfind(' ') + 1::]
        print(l[:l.rfind(' ') + 1] + str(int(int(salary13) * 0.87)))


