# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

print ('*'*10,'Задача-1','*'*10)
fruts = ['яблоко','банан','киви','арбуз']
i = 0
while len(fruts)>i:
    a=len(fruts[0])
    n=i+1
    print(str(n)+'.','{0:>15}'.format(fruts[i]))
    i+=1


# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.
print()
print ('*'*10,'Задача-2','*'*10)
list1={1,2,3,4,5,6,7,8}
list2={2,4,6,7,11,15,8}
print(list1 - list2)

# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

print()
print ('*'*10,'Задача-3','*'*10)
Ints= [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16]
newlist = []
for new in Ints:
    if new % 2 == 0:
        newlist.append(new / 4)
    else:
        newlist.append(new * 2)

print('первичный список: ', Ints)
print('новый список: ',newlist)